# Завдання 1.
#
# Написати програму, що перетворює значення рядкової змінної з формату snake_case
# в формат CapitalizedWords (a.k.a. Capitalized camelCase). Значення змінної отримуйте з input().
# Для простоти вважаємо, що значення змінної завжди складається з 3-х слів, але, можна оброблювати і "загальний випадок",
# тобто, коли будь-яка кількість слів. Наприклад: 'employee_first_name' -> 'EmployeeFirstName'.
massstr=[str(i).capitalize() for i in input().split("_")]
print(*massstr)

# Завдання 2.
#
# Даний рядок вигляду 'Taras Shevchenko*1814-03-09*1861-03-10',
# тобто вказане ім'я, прізвище та дати народження та смерті.
# Написати програму, що отримуючи такий рядок через input()
# виводить на екран окремими рядками ім'я та прізвище людини
# та її вік в роках. Для простоти при розрахунку віку можете ігнорувати
# число місяця та місяць. Тобто для рядку 'Taras Shevchenko*1814-03-09*1861-03-10' програма має вивести:

str2 = 'Taras Shevchenko*1814-03-09*1861-03-10'.replace("*", " ").replace("-", " ").split()
print(f"Name: {str2[0]} {str2[1]}")
print(f"Age {int(str2[5]) - int(str2[2])} years")

# Name: Taras Schevchenko
# Age: 47 years
#
#
# Завдання 3.
#
# Напишіть програму, яка зчитує ціле число та виводить текст,
# аналогічний наведеному у прикладі (пробіли та переведення на новий рядок важливі!).
# Перший рядок містить наступне значення, а другий рядок містить попереднє значення введеного числа:
#
#     Please enter an integer number: 1234
#     Next number for number 1234 is 1235.
#     Previous number for number 1234 is 1233.

a = input("Please enter an integer number: ")
print(f"Next number for number {a} is {int(a) + 1}")
print(f"Previous number for number {a} is {int(a) - 1}")

# Завдання 4.
#
# Напишіть програму, що запитує у користувача довільний рядок через input(), та для даного рядка виконує наступне:
#
# виведить третій символ цього рядка.
# виведить передостанній символ цього рядка.
# виведить перші п'ять символів цього рядка.
# виведить весь рядок, крім двох останніх символів.
# виведить усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться починаючи з першого).
# виведить усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
# виведить усі символи у зворотному порядку.
# виведить усі символи рядка через один у зворотному порядку, починаючи з останнього.
# виведить довжину цього рядка.
# Оформіть вивід кожного підпункту, щоб було зрозуміло, що саме виводиться. Тобто перед виводом результату треба ще вивести текст пояснення, що це.


str4 = "1234567890"
print(str4[3])  #виведить третій символ цього рядка
print(str4[-1])  # виведить передостанній символ цього рядка.
print(str4[:5])  # виведить перші п'ять символів цього рядка.
print(str4[:-2])  # виведить весь рядок, крім двох останніх символів.
print(str4[::2])  # виведить усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться починаючи з першого).
print(str4[2::3])  # виведить усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
print(str4[::-1])  # виведить усі символи у зворотному порядку.
print(str4[-2::-1])  # виведить усі символи рядка через один у зворотному порядку, починаючи з останнього.
print(len(str4))  # виведить довжину цього рядка.
