# Поміняти місцями значення змінних a та b для наступних випадків:
#
# a) За допомогою третьої проміжної змінної c. Типи значень змінних можуть бути будь-якими.
# b) Без проміжних змінних, можна використовувати лише змінні a та b. Типи значень змінних можуть бути будь-якими.
# c) Типи значень в змінних a та b можуть бути лише цілими числами. Поміняйте значення змінних використовуючи лише арифметичні операції '+' та '-'
# Не можна використовувати списків, рядків, інших колекцій. В файлі має бути не більше трьох змінних a, b та c.
#

a = 5
b = 6
print(a, b)
# a)
c = a
a = b
b = c
print(a, b)

# b)
a, b = b, a
print(a, b)

# c)
a, b = b + 1, a - 2
print(a, b)

# Завдання 2a, 2b.
#
# Написати програму, що вираховує суму усіх цифр трьохзначного числа введеного користувачем через input(). Виконати програму в двох варіантах:
#
# a) З використанням рядків (тобто після input заборонено приводити введене число до int/float/Decimal безпосередньо). Підказка: щоб отримати один символ рядку,
# треба використати квадратні дужки та індекс цього символу, індекси починаються з нуля: 'abcde'[2] == 'c'.
# b) Без використання обробки рядків (після input() одразу приведіть текст до int() та не переводьте в рядок назад, а працюйте з цим числом)

#a)
a="123"
print(sum(map(int,a)))
# использовал функцию мап для динамической типизации подходит для 2 случаев
summ=0
a=int(a)
for i in range(len(str(a))):
    q=a%10
    summ=q+summ
    a=a//10
print(summ)

# сделал по канону , бежал по функции и брал индекс каждого елемента
# Но я усовершенствовал немного , теперь  я могу вычислять сумму любого числа




